Repository: EagleEyeBW/custom_breadcrumbs
Catalog: translations/*.po
Languages: hu

source: Home
hu: Címlap

source: Delete
hu: Törlés

source: Submit
hu: Beküldés

source: edit
hu: szerkesztés

source: Placeholder tokens
hu: Helykitöltő vezérjelek

source: Node type
hu: Tartalomtípus

source: Custom breadcrumbs
hu: Egyedi morzsaútvonalak

source: Add custom breadcrumb trails for content types.
hu: Egyedi morzsaútvonal hozzáadása tartalomtípusokhoz

source: Add custom breadcrumb
hu: Egyedi morzsa hozzáadása

source: Edit custom breadcrumb
hu: Egyedi morzsa szerkesztése

source: No custom breadcrumbs have been defined.
hu: Nincs még beállított egyedi morzsa.

source: Add a new custom breadcrumb
hu: Új egyedi morzsa hozzáadása

source: The node type this custom breadcrumb trail will apply to.
hu: A tartalomtípus, melyhez az egyedi morzsa kapcsolódik.

source: Titles
hu: Címek

source: A list of titles for the breadcrumb links, one on each line.
hu: A címek listája a morzsaútvonalakhoz. Egy sorba egy cím kerüljön.

source: Paths
hu: Útvonalak

source: A list of Drupal paths for the breadcrumb links, one on each line.
hu: A Drupal útvonalak listája a morzsaútvonalakhoz. Egy sorba egy útvonal kerüljön.

source: The following placeholder tokens can be used in both paths and titles. When used in a path or title, they will be replaced with the appropriate values.
hu: A következő helykitöltő vezérjelek használhatóak mind az útvonalak, mind a címek megadásakor. Használatuk során az útvonal vagy cím elemekben a megfelelő behelyettesített érték fog megjelenni.

source: To use dynamic placeholder tokens in your breadcrumb trails (the ID or title of the current node, for example), download and install the <a href='@token'>Token module</a> from Drupal.org.
hu: Ahhoz, hogy dinamikus helykitöltő vezérjeleket lehessen használni a morzsaútvonalban (például az aktuális tartalom azonosítója, vagy címe), előbb telepíteni kell a Drupal.org-on található <em><a href='@token'>Token</a></em> modult.

source: Every link path must have a matching title. There are !paths paths, and !titles titles.
hu: Minden útvonalhoz pontosan egy cím tartozhat. Itt !paths úvonal és !titles cím van.

source: administer custom breadcrumbs
hu: egyedi morzsák adminisztrációja

source: Identifier
hu: Azonosító

source: with PHP snippet
hu: PHP kóddal

source: Breadcrumb visibility
hu: A morzsa láthatósága

source: Determine whether this breadcrumb should be displayed by using a snippet of PHP to return TRUE or FALSE. Note that this code has access to the $node variable, and can check its type or any other property.
hu: A PHP kód TRUE vagy FALSE visszatérési értéke szabályozza, hogy ez a morzsa megjelenjen vagy sem. Ez a kód hozzáfér a $node változóhoz, annak típusa vagy bármely más tulajdonsága lekérdezhető.

source: use php in custom breadcrumbs
hu: PHP kód használata az egyedi morzsákban

source: Custom Breadcrumb replacement strings updated for use with Token module.
hu: A <em>Custom Breadcrumb</em> helyettesítési szövegei frissítve lettek a <em>Token</em> modullal való együttműködéshez.

source: Allows administrators to define custom breadcrumb trails for each node type.
hu: Lehetőséget biztosít az adminisztrátorok számára egyedi morzsaútvonal készítésére minden tartalomtípushoz.

source: Special identifiers
hu: Speciális azonosítók

source: The following identifiers can be used to achieve a special behavior. Identifiers should be added to the paths area in the following format: identifier|path.<br />For example: %pathauto_id|[ogname-raw]
hu: A következő azonosítókat lehet használni egy speciális viselkedés megvalósításához. Azonosítókat lehet adni az útvonalak területéhez a következő formában: azonosító|útvonal.<br />Például: %pathauto_id|[ogname-raw]

source: Behaviour
hu: Viselkedés
